labs/flow/tmp-perf/tests/config.yaml
config:
    target: "https://service-foo.acmecorp.digital" # default target
    phases:
        # every second
        - arrivalRate: 0
          duration: 300
          rampTo: 50
    http:
        timeout: 10
    plugins:
        metrics-by-endpoint: {}
    # ensure:
    # To check that the aggregate p95 latency is 200ms or less, and make Artillery exit with a non-zero exit code if it’s over 200
    # min, max, median, p95, and p99 may be set.
    #   p95: 200
    environments:
        local-dev-secure:
            target: "https://localhost:8001"
            tls:
                rejectUnauthorized: false
            phases:
                - arrivalRate: 10
                  duration: 60
                - arrivalRate: 25
                  duration: 60
                - arrivalRate: 50
                  duration: 60
                - arrivalRate: 100
                  duration: 60
                - arrivalRate: 200
                  duration: 60
        local-dev:
            target: "http://localhost:8000"
            tls:
                rejectUnauthorized: false
            phases:
                - arrivalRate: 10
                  duration: 60
                - arrivalRate: 25
                  duration: 60
                - arrivalRate: 50
                  duration: 60
                - arrivalRate: 100
                  duration: 60
                - arrivalRate: 200
                  duration: 60
        staging:
            target: "https://service-foo.preprod.acmecorp.digital"